Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.4.68/samd20/edc/ATSAMD20E15.PIC
      <edc:SFRDef edc:_addr="0x4200280E" edc:access="--nnn-nn" edc:cname="INTFLAG" edc:impl="0x3B" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="OVF" edc:desc="Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="Error" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SYNCRDY" edc:desc="Synchronization Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC0" edc:desc="Match or Capture Channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC1" edc:desc="Match or Capture Channel 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200280F" edc:access="r--rr---" edc:cname="STATUS" edc:impl="0x98" edc:mclr="00001000" edc:nzwidth="0x8" edc:por="00001000" ltx:memberofperipheral="TC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="STOP" edc:desc="Stop" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLAVE" edc:desc="Slave" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SYNCBUSY" edc:desc="Synchronization Busy" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42002810" edc:offset="0x3F0"/>
      <edc:SFRDef edc:_addr="0x42002C00" edc:access="--nnnnnn-nn-nnnn" edc:cname="CTRLA" edc:impl="0x3F6F" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="TC Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="COUNT16" edc:desc="Counter in 16-bit mode" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="COUNT8" edc:desc="Counter in 8-bit mode" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="COUNT32" edc:desc="Counter in 32-bit mode" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WAVEGEN" edc:desc="Waveform Generation Operation" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NFRQ" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MFRQ" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="NPWM" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="MPWM" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRESCALER" edc:desc="Prescaler" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="GCLK_TC" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="GCLK_TC/2" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="GCLK_TC/4" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="GCLK_TC/8" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="GCLK_TC/16" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="GCLK_TC/64" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="GCLK_TC/256" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="GCLK_TC/1024" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRESCSYNC" edc:desc="Prescaler and Counter Synchronization" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="Reload or reset Counter on next GCLK" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESC" edc:desc="Reload or reset Counter on next prescaler clock" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RESYNC" edc:desc="Reload or reset Counter on next GCLK. Reset prescaler counter" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002C02" edc:access="nn---------nnnnn" edc:cname="READREQ" edc:impl="0xC01F" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Address" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="RCONT" edc:desc="Read Continuously" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RREQ" edc:desc="Read Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002C04" edc:access="nn---n-n" edc:cname="CTRLBCLR" edc:impl="0xC5" edc:mclr="00000010" edc:nzwidth="0x8" edc:por="00000010" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Counter Direction" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ONESHOT" edc:desc="One-Shot" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="Command" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No action" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RETRIGGER" edc:desc="Force start, restart or retrigger" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="Force stop" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002C05" edc:access="nn---n-n" edc:cname="CTRLBSET" edc:impl="0xC5" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Counter Direction" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ONESHOT" edc:desc="One-shot" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="Command" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No action" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RETRIGGER" edc:desc="Force start, restart or retrigger" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="Force stop" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
