Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.4.68/samd20/edc/ATSAMD20E15.PIC
      <edc:SFRDef edc:access="-----nnn" edc:addr="0x42000C0E" edc:cname="INTFLAG" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM1">
            <edc:SFRFieldDef edc:cname="DRE" edc:desc="Data Register Empty" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXC" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXC" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="n------------n--" edc:addr="0x42000C10" edc:cname="STATUS" edc:impl="0x8004" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SERCOM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BUFOVF" edc:desc="Buffer Overflow" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="SYNCBUSY" edc:desc="Synchronization Busy" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------nnnnnnnn--------nnnnnnnn" edc:addr="0x42000C14" edc:cname="ADDR" edc:impl="0xFF00FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM1">
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Address" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="ADDRMASK" edc:desc="Address Mask" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------nnnnnnnnn" edc:addr="0x42000C18" edc:cname="DATA" edc:impl="0x1FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SERCOM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM1">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data Value" edc:nzwidth="0x9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:RegisterMap edc:id="SERCOM1/I2CS">
      <edc:SFRDef edc:access="-n--------nn---n--------n--nnnnn" edc:addr="0x42000C00" edc:cname="CTRLA" edc:impl="0x4031009F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM1">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="Operating Mode" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="USART_EXT_CLK" edc:desc="USART with external clock" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="USART_INT_CLK" edc:desc="USART with internal clock" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SPI_SLAVE" edc:desc="SPI in slave operation" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SPI_MASTER" edc:desc="SPI in master operation" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="I2C_SLAVE" edc:desc="I2C slave operation" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="I2C_MASTER" edc:desc="I2C master operation" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="PINOUT" edc:desc="Pin Usage" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SDAHOLD" edc:desc="SDA Hold Time" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disabled" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="75NS" edc:desc="50-100ns hold time" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="450NS" edc:desc="300-600ns hold time" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="600NS" edc:desc="400-800ns hold time" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="LOWTOUT" edc:desc="SCL Low Time-out" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------------nnnnn-----n--------" edc:addr="0x42000C04" edc:cname="CTRLB" edc:impl="0x7C100" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM1">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="SMEN" edc:desc="Smart Mode Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="AMODE" edc:desc="Address Mode" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="Command" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ACKACT" edc:desc="Acknowledge Action" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-----nnn" edc:addr="0x42000C0C" edc:cname="INTENCLR" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM1">
            <edc:SFRFieldDef edc:cname="PREC" edc:desc="Stop Received Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AMATCH" edc:desc="Address Match Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Ready Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-----nnn" edc:addr="0x42000C0D" edc:cname="INTENSET" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SERCOM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM1">
            <edc:SFRFieldDef edc:cname="PREC" edc:desc="Stop Received Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AMATCH" edc:desc="Address Match Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Ready Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
